import http from 'axios'

let baseUrl = '../public/'

/**********************************************************************************
 * 教师查询班级课表
 *********************************************************************************/

 export const getClassSchedule = (params) => {
    return http(`${baseUrl}/thrCou!querySch.action`,{params})
 }

 /********************************************************************************
  * 获取学期列表
  ********************************************************************************/

  export const getTermList = (params) => {
      return http(`${baseUrl}/baseWebDat`,{params})
  }

 /********************************************************************************
  * 获取年份Id与名称(即年级，如2018级)
  ********************************************************************************/

  export const getGradeList = (params) => {
      return http(`${baseUrl}/baseWebDat`,{params})
  }

  /******************************************************************************
   * 获取当前是第几周
   ******************************************************************************/

   export const getCurWeek = (params) => {
    return http(`${baseUrl}/term!weekN.action`,{params})
   }

  /******************************************************************************
   * 获取行政班列表
   ******************************************************************************/

   export const getAdminClassList = (params) => {
    return http(`${baseUrl}/baseWebDat`,{params})
   }